cv.org
#+TITLE: Curriculum Vitæ of James Pascaleff

* Contact
University of Illinois at Urbana-Champaign\\
Department of Mathematics\\
1409 W. Green Street\\
Urbana, IL 61801

Office: 805 W. Pennsylvania Avenue, Room 306\\
Telephone: +1 217 244 7277\\
Email: [[mailto:jpascale@illinois.edu][jpascale@illinois.edu]]\\
Website: [[http://pascaleff.com][pascaleff.com]]

* Employment
  - August 2014--Present: University of Illinois at Urbana-Champaign :: Associate Professor (with tenure) from August 16, 2020. Formerly: Assistant Professor.
  - August 2011--August 2014: University of Texas at Austin :: Instructor and RTG Postdoctoral Fellow
** Visiting positions
  - January--April 2022: Scuola Internazionale Superiore di Studi Avanzati (SISSA), Trieste :: Visitor
  - January--April 2017: Institute for Advanced Study, Princeton, NJ :: Member, School of Mathematics
  - September--November 2015: Institut Mittag-Leffler, Djursholm, Sweden :: Participant in the program "Sympletic Geometry and Topology"
  - June--August 2014: Max-Planck-Institut für Mathematik, Bonn :: Guest  
  - July--August 2013: King's College London :: Visiting Research Associate

* Education
  - Ph.D. in Mathematics (2011) Massachusetts Institute of Technology ::
       Thesis: /Floer cohomology in the mirror of the projective plane
       and a binodal cubic curve/.
       (Defended April 15, 2011; advisor: Denis Auroux)
  - A.B. in Mathematics (2006) University of Chicago :: with honors.

* Grants awarded
** External
  - 2014--2017 NSF award, /Symplectic Cohomology, log Calabi--Yau Varieties, and equivariant Lagrangian Submanifolds./ 
  - 2019--2024 Simons Foundation, Collaboration Grant, /Fukaya categories: wall-crossing, quantization, and higher categorical structures./
** Internal (UIUC)
  - 2024--2025 Campus Research Board, /Loop Spaces, Homological Algebra, and Symplectic Geometry/.

* Honors & fellowships
  - RTG Postdoctoral Fellowship (part of NSF grants DMS-0636557 and DMS-1148490) (2011--2014)
  - MIT Presidential Fellowship (2006--2007)
  - Paul R. Cohen Memorial Prize (Senior Mathematics prize at the University of Chicago) (2006)
  - Phi Beta Kappa, member, Beta of Illinois chapter (2005)
  - Sigma Xi, associate member, University of Chicago chapter (2005)
  - University of Chicago National Merit Scholarship (2002--2006)

* Research interests
  Symplectic geometry and topology, Floer theory, and homological mirror symmetry.

* Publications
  1. Floer cohomology in the mirror of the projective plane and a
     binodal cubic curve. /Duke Math. J./ Volume 163, Number 13 (2014), pp. 2427--2516.  ([[http://arxiv.org/abs/1109.3255][arXiv:1109.3255]])
  2. On the symplectic cohomology of log Calabi--Yau surfaces. /Geom. Topol./ Volume 23, Issue 6 (2019), pp. 2701--2792. ([[http://arxiv.org/abs/1304.5298][arXiv:1304.5298]])
  3. (with Yankı Lekili) Floer cohomology of g-equivariant Lagrangian branes. /Compositio Math./ Volume 152, Issue 05 (2016), pp. 1071--1110. ([[http://arxiv.org/abs/1310.8609][arXiv:1310.8609]])
  4. (with Nicolò Sibilla) Topological Fukaya category and mirror symmetry for punctured surfaces. /Compositio Math./ Volume 155, Issue 3 (2019), pp. 599--644. ([[https://arxiv.org/abs/1604.06448][arXiv:1604.06448]])  
  5. (with Dmitry Tonkonog) The wall-crossing formula and Lagrangian mutations. /Adv. Math./ Volume 361, 12 February 2020, 106850. ([[https://arxiv.org/abs/1711.03209][arXiv:1711.03209]])
  6. Poisson geometry, monoidal Fukaya categories, and commutative Floer cohomology rings. /Enseign. Math./ 70 (2024), no. 3/4, pp. 313–381. ([[https://www.arxiv.org/abs/1803.07676][arXiv:1803.07676]])
  7. (with Nicolò Sibilla) Fukaya categories of higher-genus surfaces and pants decompositions. ([[https://arxiv.org/abs/2103.03366][arXiv:2103.03366]])
  8. (with Nicolò Sibilla) Singularity categories of normal crossings surfaces, descent, and mirror symmetry. ([[https://arxiv.org/abs/2208.03896][arXiv:2208.03896]])
  9. Remarks on the equivalence between differential graded categories and A-infinity categories. /Homology, Homotopy and Applications/, vol. 26(1), 2024, pp. 275--285. ([[https://arxiv.org/abs/2211.05861][arXiv:2211.05861]])
  10. (with Emanuele Pavia and Nicolò Sibilla) Higher local systems and the categorified monodromy equivalence. ([[https://arxiv.org/abs/2501.10241][arxiv:2501.10241]])
  11. (with Emanuele Pavia and Nicolò Sibilla) Higher Koszul duality and n-affineness. ([[https://arxiv.org/abs/2504.16935][arXiv:2504.16935]])
  12. (with Nicolò Sibilla) Speculations on higher Fukaya categories. ([[https://arxiv.org/abs/2503.20906][arXiv:2503.20906]])

