cv.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-05 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Curriculum Vitæ of James Pascaleff</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" title="Standard" href="css/worg.css" type="text/css">
<link rel="alternate stylesheet" title="Zenburn" href="css/worg-zenburn.css" type="text/css" />
<link rel="alternate stylesheet" title="Classic" href="css/worg-classic.css" type="text/css" />
<link rel="shortcut icon" href="https://math.illinois.edu/themes/custom/las_unit_theme/favicon-32x32.png" type="image/png" />
</head>
<body>
<main id="content">
<header>
<h1 class="title">Curriculum Vitæ of James Pascaleff</h1>
</header>
<section id="outline-container-org7b5d2b8" class="outline-2">
<h2 id="org7b5d2b8">Contact</h2>
<div class="outline-text-2" id="text-org7b5d2b8">
<p>
University of Illinois at Urbana-Champaign<br>
Department of Mathematics<br>
1409 W. Green Street<br>
Urbana, IL 61801
</p>

<p>
Office: 805 W. Pennsylvania Avenue, Room 306<br>
Telephone: +1 217 244 7277<br>
Email: <a href="mailto:jpascale@illinois.edu">jpascale@illinois.edu</a><br>
Website: <a href="http://pascaleff.com">pascaleff.com</a>
</p>
</div>
</section>

<section id="outline-container-org27023e5" class="outline-2">
<h2 id="org27023e5">Employment</h2>
<div class="outline-text-2" id="text-org27023e5">
<dl class="org-dl">
<dt>August 2014&#x2013;Present: University of Illinois at Urbana-Champaign</dt><dd>Associate Professor (with tenure) from August 16, 2020. Formerly: Assistant Professor.</dd>
<dt>August 2011&#x2013;August 2014: University of Texas at Austin</dt><dd>Instructor and RTG Postdoctoral Fellow</dd>
</dl>
</div>
<div id="outline-container-orgb3ed89f" class="outline-3">
<h3 id="orgb3ed89f">Visiting positions</h3>
<div class="outline-text-3" id="text-orgb3ed89f">
<dl class="org-dl">
<dt>January&#x2013;April 2022: Scuola Internazionale Superiore di Studi Avanzati (SISSA), Trieste</dt><dd>Visitor</dd>
<dt>January&#x2013;April 2017: Institute for Advanced Study, Princeton, NJ</dt><dd>Member, School of Mathematics</dd>
<dt>September&#x2013;November 2015: Institut Mittag-Leffler, Djursholm, Sweden</dt><dd>Participant in the program &ldquo;Sympletic Geometry and Topology&rdquo;</dd>
<dt>June&#x2013;August 2014: Max-Planck-Institut für Mathematik, Bonn</dt><dd>Guest</dd>
<dt>July&#x2013;August 2013: King&rsquo;s College London</dt><dd>Visiting Research Associate</dd>
</dl>
</div>
</div>
</section>

<section id="outline-container-org4034436" class="outline-2">
<h2 id="org4034436">Education</h2>
<div class="outline-text-2" id="text-org4034436">
<dl class="org-dl">
<dt>Ph.D. in Mathematics (2011) Massachusetts Institute of Technology</dt><dd>Thesis: <i>Floer cohomology in the mirror of the projective plane
and a binodal cubic curve</i>.
(Defended April 15, 2011; advisor: Denis Auroux)</dd>
<dt>A.B. in Mathematics (2006) University of Chicago</dt><dd>with honors.</dd>
</dl>
</div>
</section>

<section id="outline-container-org3924614" class="outline-2">
<h2 id="org3924614">Grants awarded</h2>
<div class="outline-text-2" id="text-org3924614">
</div>
<div id="outline-container-org4d63b49" class="outline-3">
<h3 id="org4d63b49">External</h3>
<div class="outline-text-3" id="text-org4d63b49">
<ul class="org-ul">
<li>2014&#x2013;2017 NSF award, <i>Symplectic Cohomology, log Calabi&#x2013;Yau Varieties, and equivariant Lagrangian Submanifolds.</i></li>
<li>2019&#x2013;2024 Simons Foundation, Collaboration Grant, <i>Fukaya categories: wall-crossing, quantization, and higher categorical structures.</i></li>
</ul>
</div>
</div>
<div id="outline-container-org24b7212" class="outline-3">
<h3 id="org24b7212">Internal (UIUC)</h3>
<div class="outline-text-3" id="text-org24b7212">
<ul class="org-ul">
<li>2024&#x2013;2025 Campus Research Board, <i>Loop Spaces, Homological Algebra, and Symplectic Geometry</i>.</li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org2c56a82" class="outline-2">
<h2 id="org2c56a82">Honors &amp; fellowships</h2>
<div class="outline-text-2" id="text-org2c56a82">
<ul class="org-ul">
<li>RTG Postdoctoral Fellowship (part of NSF grants DMS-0636557 and DMS-1148490) (2011&#x2013;2014)</li>
<li>MIT Presidential Fellowship (2006&#x2013;2007)</li>
<li>Paul R. Cohen Memorial Prize (Senior Mathematics prize at the University of Chicago) (2006)</li>
<li>Phi Beta Kappa, member, Beta of Illinois chapter (2005)</li>
<li>Sigma Xi, associate member, University of Chicago chapter (2005)</li>
<li>University of Chicago National Merit Scholarship (2002&#x2013;2006)</li>
</ul>
</div>
</section>

<section id="outline-container-org20fdaa0" class="outline-2">
<h2 id="org20fdaa0">Research interests</h2>
<div class="outline-text-2" id="text-org20fdaa0">
<p>
Symplectic geometry and topology, Floer theory, and homological mirror symmetry.
</p>
</div>
</section>

<section id="outline-container-orgb567b66" class="outline-2">
<h2 id="orgb567b66">Publications</h2>
<div class="outline-text-2" id="text-orgb567b66">
<ol class="org-ol">
<li>Floer cohomology in the mirror of the projective plane and a
binodal cubic curve. <i>Duke Math. J.</i> Volume 163, Number 13 (2014), pp. 2427&#x2013;2516.  (<a href="http://arxiv.org/abs/1109.3255">arXiv:1109.3255</a>)</li>
<li>On the symplectic cohomology of log Calabi&#x2013;Yau surfaces. <i>Geom. Topol.</i> Volume 23, Issue 6 (2019), pp. 2701&#x2013;2792. (<a href="http://arxiv.org/abs/1304.5298">arXiv:1304.5298</a>)</li>
<li>(with Yankı Lekili) Floer cohomology of g-equivariant Lagrangian branes. <i>Compositio Math.</i> Volume 152, Issue 05 (2016), pp. 1071&#x2013;1110. (<a href="http://arxiv.org/abs/1310.8609">arXiv:1310.8609</a>)</li>
<li>(with Nicolò Sibilla) Topological Fukaya category and mirror symmetry for punctured surfaces. <i>Compositio Math.</i> Volume 155, Issue 3 (2019), pp. 599&#x2013;644. (<a href="https://arxiv.org/abs/1604.06448">arXiv:1604.06448</a>)</li>
<li>(with Dmitry Tonkonog) The wall-crossing formula and Lagrangian mutations. <i>Adv. Math.</i> Volume 361, 12 February 2020, 106850. (<a href="https://arxiv.org/abs/1711.03209">arXiv:1711.03209</a>)</li>
<li>Poisson geometry, monoidal Fukaya categories, and commutative Floer cohomology rings. <i>Enseign. Math.</i> 70 (2024), no. 3/4, pp. 313–381. (<a href="https://www.arxiv.org/abs/1803.07676">arXiv:1803.07676</a>)</li>
<li>(with Nicolò Sibilla) Fukaya categories of higher-genus surfaces and pants decompositions. (<a href="https://arxiv.org/abs/2103.03366">arXiv:2103.03366</a>)</li>
<li>(with Nicolò Sibilla) Singularity categories of normal crossings surfaces, descent, and mirror symmetry. (<a href="https://arxiv.org/abs/2208.03896">arXiv:2208.03896</a>)</li>
<li>Remarks on the equivalence between differential graded categories and A-infinity categories. <i>Homology, Homotopy and Applications</i>, vol. 26(1), 2024, pp. 275&#x2013;285. (<a href="https://arxiv.org/abs/2211.05861">arXiv:2211.05861</a>)</li>
</ol>
</div>
</section>
