cv.org
* Talks
  1. Dec. 2010, Northern California Symplectic Geometry Seminar, Stanford University.\\
     /Floer cohomology in the mirror of CP^2 relative to a conic and a line./
  2. Jan. 2011, Workshop on Homological Mirror Symmetry and Related
     Topics, University of Miami (Florida).\\
     /Floer cohomology in the mirror of CP^2 relative to a conic and a line./
  3. Jan. 2011, Gauge Theory and Topology Seminar, Harvard
     University.\\
     /Floer cohomology in the mirror of CP^2 relative to a conic and a line./
  4. Feb. 2011, Symplectic Geometry, Gauge Theory and
     Categorification Seminar, Columbia University.\\
     /Floer cohomology in the mirror of CP^2 relative to a conic and a line./
  5. Apr. 2011, Geometry Seminar, University of Texas at Austin.\\
     /Floer cohomology in the mirror of CP^2 relative to a conic and a line./
  6. May 2011, Equivariant Quantum Cohomology, Mirror Symmetry and
     Symplectic Geometry Workshop, Simons Center for Geometry and
     Physics.\\
     /On Wrapped Floer Cohomology and Mirror Symmetry for Complements of Divisors./
  7. Oct. 2011, Geometry Seminar, Texas A&M University.
  8. Dec. 2012, Mirror Symmetry Seminar, Kansas State University.\\
     /Some apects of Floer theory on Log Calabi-Yau surfaces./
  9. Mar. 2013, Differential Geometry Seminar, Cambridge University.\\
     /On the symplectic geometry of Log Calabi-Yau surfaces./
  10. May 2013, Geometry Seminar, University of Texas at Austin.\\
      /On the symplectic cohomology of log Calabi-Yau surfaces./
  11. Nov. 2013, Geometry Seminar, Texas A&M University.\\
      /Symplectic cohomology and equivariant Lagrangian submanifolds./
  12. Nov. 2013, Geometry and Topology Seminar, University of Massachusetts Amherst.\\
      /Symplectic cohomology and equivariant Lagrangian submanifolds./
  13. Jan. 2014, Conference on Homological Mirror Symmetry, University of Miami (Florida).\\
      /Equivariant Lagrangian branes and representations./
  14. Feb. 2014, Colloquium, University of Illinois at Urbana-Champaign.\\
      /Equivariant structures in mirror symmetry and distinguished bases from symplectic geometry./
  15. May 2014, Equivariant Gromov-Witten Theory and Applications workshop, Simons Center for Geometry and Physics.\\
      /Symplectic cohomology and equivariant Lagrangian branes./
  16. Jul. 2014, Mathematical Landings: A Norman conference in geometry and representation theory, Lingeard, France.\\
      /Symplectic cohomology and equivariant Lagrangian branes./ [[http://jpascale.web.illinois.edu/la-manche-libre.pdf][Media coverage.]]
  17. Sep. 2014, Symplectic and Poisson Geometry Seminar, University of Illinois at Urbana-Champaign.\\
      /Symplectic cohomology and its role in mirror symmetry./
  18. Oct. 2014, Princeton/IAS Symplectic Geometry Seminar, Institute for Advanced Study.\\
      /Equivariant structures in mirror symmetry./
  19. Dec. 2014, UIUC-WUSTL Symplectic Geometry Seminar, Urbana, Illinois.\\
      /Symplectic cohomology of log Calabi-Yau manifolds./
  20. Jan. 2015, Topology and Geometry Seminar, Hebrew University, Jerusalem.\\
      /Equivariant Lagrangian branes and representations./
  21. Mar. 2015, Geometry, Groups and Dynamics/GEAR Seminar, University of Illinois at Urbana-Champaign.\\
      /How can you have dynamics when all you have is a category?/
  22. Mar. 2015, Introduction to Graduate Mathematics Seminar, University of Illinois at Urbana-Champaign.\\
      /Triangles and the theta series/
  23. May 2015, Symplectic Geometry Seminar, Stanford University.\\
      /Equivariant Lagrangians and representations./
  24. Sep. 2015, Symplectic Geometry and Topology Program Seminar, Institut Mittag-Leffler, Djursholm, Sweden.\\
      /Gluing Fukaya categories associated to ribbon graphs./
  25. Oct. 2015, Geometry and Quantum Theory Colloquium, Woudschoten, Zeist, The Netherlands.\\
      /Symplectic cohomology and mirror symmetry./
  26. Nov. 2015, Edinburgh Geometry Seminar (EDGE), Edinburgh Hodge Institute, Scotland.\\
      /Equivariant structures on Lagrangian submanifolds./
  27. Dec. 2015, Mirror Symmetry and Symplectic Geometry Conference, Kyoto University, Japan.\\
      /Wrapped Floer cohomology and Equivariant Mirror Symmetry./ (150 minute lecture series)
  28. Feb. 2016, Symplectic and Poisson Geometry Seminar, University of Illinois at Urbana-Champaign.\\
      /Gluing Fukaya categories of Riemann surfaces./
  29. Mar. 2016, Conference on Mirror Symmetry and Wall-Crossing, UC Berkeley.\\
      /Symplectic geometry of scattering diagrams for log CY surfaces./
  30. Jul. 2016, Emmy Noether Kolloquium, Johannes Gutenberg University, Mainz, Germany.\\
      /Symplectic cohomology and wall crossing./
  31. Jul. 2016, Symplectic working group seminar, Cambridge University.
  32. Sep. 2017, Symplectic and Poisson Geometry Seminar, University of Illinois at Urbana-Champaign.\\
      /Relative Floer theory and wall-crossing./
  33. Sep. 2017, AMS Fall Southeastern Sectional Meeting, Special Session on Symplectic and Contact Topology and Dynamics, University of Central Florida.\\
      /Fukaya categories and Poisson geometry./
  34. Oct. 2017, Back Porch Seminar, Austin, TX.\\
      /Relative Floer theory and wall-crossing./
  35. Oct. 2017, Geometry Seminar, University of Texas at Austin.\\
      /Commutativity and noncommutativity in Floer theory./
  36. Oct. 2017, Algebraic Geometry Seminar, University of Chicago.\\
      /2D topological field theories from algebraic and symplectic geometry (expository talk)./
  37. Nov. 2017, Algebraic Geometry Seminar, University of Chicago.\\
      /Symplectic geometry and theta functions./
  38. Dec. 2017, Workshop on Categorification, Representation Theory, and Symplectic Geometry, Hausdorff Research Institute for Mathematics, Bonn.\\
      /Poisson geometry and monoidal Fukaya categories./
  39. Feb. 2018, Symplectic and Poisson Geometry Seminar, University of Illinois at Urbana-Champaign.\\
      /Symplectic groupoids and monoidal Fukaya categories./
  40. Apr. 2018, Introduction to Graduate Mathematics Seminar, University of Illinois at Urbana-Champaign.\\
      /Symplectic geometry and categorification./
  41. Jun. 2018, Focus Program on Poisson Geometry and Physics, The Fields Institute.\\
      /Structures in the Floer theory of symplectic Lie groupoids./ (Mini-course, approximately 6 hours)
  42. Jul. 2018, A Symplectic Cut, a joint seminar of King's College London and University College London.\\
      /Symplectic groupoids and monoidal Fukaya categories./
  43. Oct. 2018, IAS/PU Symplectic Geometry and Dynamics Seminar, Institute for Advanced Study, Princeton, NJ.\\
      /Structures in the Floer theory of symplectic Lie groupoids./
  44. Oct. 2018, Geometry and Physics Seminar, Northwestern University.\\
      /Wall-crossing formulas for Lagrangian mutations./ Pre-talk: /Monotone Lagrangians and disk counting./
  45. Oct. 2018, Conference on Wall-crossing formula, open Gromov-Witten invariants and related areas, Institute for Basic Science/Center for Geometry and Physics, Pohang University of Science and Technology, Pohang, Korea.\\
      /Wall-crossing formulas for Lagrangian mutations./
  46. Feb. 2019, Mathematics Inspired by String Theory (MIST) 2019 Workshop II, Chinese University of Hong Kong.\\
      /Structures in the Floer theory of symplectic Lie groupoids./
  47. Mar. 2019, Mathematics Colloquium, Indiana University.\\
      /Lagrangian submanifolds and disk counting./
  48. Mar. 2019, Number Theory and Algebraic Geometry Seminar, Boston College.\\
      /Lagrangian submanifolds, disk counting, and wall-crossing./
  49. Apr. 2019, Symplectic Representation Theory, CIRM Luminy, France.\\
      /On monoidal structures on Fukaya categories./
  50. Apr. 2019, Symplectic Geometry, Gauge Theory, and Categorification Seminar, Columbia University.\\
      /On monoidal structures on Fukaya categories./
  51. Aug. 2019, International Conference on Symplectic Topology, IMPA, Rio de Janeiro, Brazil.\\
      /On the Floer-theoretic nature of canonical bases./
  52. Dec. 2019, Hodge Institute, University of Edinburgh, Scotland.\\
      /Moduli spaces of Lagrangians in symplectic topology and mirror symmetry./
  53. Jan. 2020, International Workshop on Symplectic Geometry, Sun Yat-sen University, Guangzhou, China.\\
      /Moduli spaces of Lagrangians in symplectic topology and mirror symmetry./ (Three-hour lecture series)
  54. Oct. 2020, Winter School "Connections between representation theory and geometry," Hausdorff Research Institute for Mathematics.\\
      /Introduction to Fukaya Categories./ (Three-hour minicourse)
  55. Jun. 2021, Seminario de Geometría y Física Matemática, Universidad Católica del Norte (Chile) and Universidade de São Paulo (Brazil).\\
      /Structures in the Floer theory of Symplectic Groupoids./
  56. Jun. 2021, Braids, mutations and twists in algebra and geometry, Uppsala University.\\
      /Moduli spaces of objects and wall-crossing for disk potentials./
  57. Jun. 2021, Guest lecturer in a reading course on Fukaya categories, University of Vienna.\\
      /Examples of Fukaya categories and mirror symmetry./ (Three hours)
  58. Nov. 2021, Geometry and Physics Seminar, Northwestern University.\\
      /Gluing Fukaya categories of surfaces and singularity categories./
  59. Mar. 2022, Western Hemisphere Virtual Symplectic Seminar.\\
      /Categories obtained from pants decompositions./
  60. Apr. 2022, Virtual Joint Mathematics Meetings, AMS Special Session on Quantum Categorical Structures in Mirror Symmetry.\\
      /Fukaya categories and pants decompositions of surfaces./
  61. Nov. 2022, Workshop on matrix factorizations and related topics, University of Notre Dame.\\
      /Singular support of coherent sheaves and mirror symmetry./
  62. Apr. 2023, AMS Spring Central Sectional Meeting, Special Session on Quantitative Aspects of Symplectic Topology, University of Cincinnati.\\
      /Mirrors of normal crossings surfaces at infinity./
  63. Nov. 2023, Seminar on 3D Mirror Symmetry and Elliptic Cohomology, SISSA.\\
      /Higher Fukaya Categories and 3D HMS./
  64. Sep. 2024, Symplectic and Poisson Geometry Seminar, UIUC.\\
      /Fukaya categories of surfaces and pants decompositions./
  65. Oct. 2024, What is...? Seminar, UIUC.\\
      /What is a Batalin-Vilkovisky algebra?/
  66. Dec. 2024, UIUC-WUSTL Symplectic Geometry Seminar, Urbana, Illinois.\\
      /Fukaya categories of surfaces and pants decompositions./
  67. Mar. 2025, Hong Kong Geometry Colloquium/Mathematics Inspired by String Theory (MIST) Workshop, Chinese University of Hong Kong.\\
      /Toward Higher Fukaya Categories./
  68. Aug. 2025, Representations, Moduli and Duality, SwissMAP Research Station in Les Diablerets.\\
      /Toward Higher Fukaya Categories./
  69. Sep. 2025, MIT Symplectic Seminar.\\
      /Categorical Local Systems and Higher Fukaya Categories./
      
