cv.html


<section id="outline-container-org8c81827" class="outline-2">
<h2 id="org8c81827">Talks</h2>
<div class="outline-text-2" id="text-org8c81827">
<ol class="org-ol">
<li>Dec. 2010, Northern California Symplectic Geometry Seminar, Stanford University.<br>
<i>Floer cohomology in the mirror of CP<sup>2</sup> relative to a conic and a line.</i></li>
<li>Jan. 2011, Workshop on Homological Mirror Symmetry and Related
Topics, University of Miami (Florida).<br>
<i>Floer cohomology in the mirror of CP<sup>2</sup> relative to a conic and a line.</i></li>
<li>Jan. 2011, Gauge Theory and Topology Seminar, Harvard
University.<br>
<i>Floer cohomology in the mirror of CP<sup>2</sup> relative to a conic and a line.</i></li>
<li>Feb. 2011, Symplectic Geometry, Gauge Theory and
Categorification Seminar, Columbia University.<br>
<i>Floer cohomology in the mirror of CP<sup>2</sup> relative to a conic and a line.</i></li>
<li>Apr. 2011, Geometry Seminar, University of Texas at Austin.<br>
<i>Floer cohomology in the mirror of CP<sup>2</sup> relative to a conic and a line.</i></li>
<li>May 2011, Equivariant Quantum Cohomology, Mirror Symmetry and
Symplectic Geometry Workshop, Simons Center for Geometry and
Physics.<br>
<i>On Wrapped Floer Cohomology and Mirror Symmetry for Complements of Divisors.</i></li>
<li>Oct. 2011, Geometry Seminar, Texas A&amp;M University.</li>
<li>Dec. 2012, Mirror Symmetry Seminar, Kansas State University.<br>
<i>Some apects of Floer theory on Log Calabi-Yau surfaces.</i></li>
<li>Mar. 2013, Differential Geometry Seminar, Cambridge University.<br>
<i>On the symplectic geometry of Log Calabi-Yau surfaces.</i></li>
<li>May 2013, Geometry Seminar, University of Texas at Austin.<br>
<i>On the symplectic cohomology of log Calabi-Yau surfaces.</i></li>
<li>Nov. 2013, Geometry Seminar, Texas A&amp;M University.<br>
<i>Symplectic cohomology and equivariant Lagrangian submanifolds.</i></li>
<li>Nov. 2013, Geometry and Topology Seminar, University of Massachusetts Amherst.<br>
<i>Symplectic cohomology and equivariant Lagrangian submanifolds.</i></li>
<li>Jan. 2014, Conference on Homological Mirror Symmetry, University of Miami (Florida).<br>
<i>Equivariant Lagrangian branes and representations.</i></li>
<li>Feb. 2014, Colloquium, University of Illinois at Urbana-Champaign.<br>
<i>Equivariant structures in mirror symmetry and distinguished bases from symplectic geometry.</i></li>
<li>May 2014, Equivariant Gromov-Witten Theory and Applications workshop, Simons Center for Geometry and Physics.<br>
<i>Symplectic cohomology and equivariant Lagrangian branes.</i></li>
<li>Jul. 2014, Mathematical Landings: A Norman conference in geometry and representation theory, Lingeard, France.<br>
<i>Symplectic cohomology and equivariant Lagrangian branes.</i> <a href="http://jpascale.web.illinois.edu/la-manche-libre.pdf">Media coverage.</a></li>
<li>Sep. 2014, Symplectic and Poisson Geometry Seminar, University of Illinois at Urbana-Champaign.<br>
<i>Symplectic cohomology and its role in mirror symmetry.</i></li>
<li>Oct. 2014, Princeton/IAS Symplectic Geometry Seminar, Institute for Advanced Study.<br>
<i>Equivariant structures in mirror symmetry.</i></li>
<li>Dec. 2014, UIUC-WUSTL Symplectic Geometry Seminar, Urbana, Illinois.<br>
<i>Symplectic cohomology of log Calabi-Yau manifolds.</i></li>
<li>Jan. 2015, Topology and Geometry Seminar, Hebrew University, Jerusalem.<br>
<i>Equivariant Lagrangian branes and representations.</i></li>
<li>Mar. 2015, Geometry, Groups and Dynamics/GEAR Seminar, University of Illinois at Urbana-Champaign.<br>
<i>How can you have dynamics when all you have is a category?</i></li>
<li>Mar. 2015, Introduction to Graduate Mathematics Seminar, University of Illinois at Urbana-Champaign.<br>
<i>Triangles and the theta series</i></li>
<li>May 2015, Symplectic Geometry Seminar, Stanford University.<br>
<i>Equivariant Lagrangians and representations.</i></li>
<li>Sep. 2015, Symplectic Geometry and Topology Program Seminar, Institut Mittag-Leffler, Djursholm, Sweden.<br>
<i>Gluing Fukaya categories associated to ribbon graphs.</i></li>
<li>Oct. 2015, Geometry and Quantum Theory Colloquium, Woudschoten, Zeist, The Netherlands.<br>
<i>Symplectic cohomology and mirror symmetry.</i></li>
<li>Nov. 2015, Edinburgh Geometry Seminar (EDGE), Edinburgh Hodge Institute, Scotland.<br>
<i>Equivariant structures on Lagrangian submanifolds.</i></li>
<li>Dec. 2015, Mirror Symmetry and Symplectic Geometry Conference, Kyoto University, Japan.<br>
<i>Wrapped Floer cohomology and Equivariant Mirror Symmetry.</i> (150 minute lecture series)</li>
<li>Feb. 2016, Symplectic and Poisson Geometry Seminar, University of Illinois at Urbana-Champaign.<br>
<i>Gluing Fukaya categories of Riemann surfaces.</i></li>
<li>Mar. 2016, Conference on Mirror Symmetry and Wall-Crossing, UC Berkeley.<br>
<i>Symplectic geometry of scattering diagrams for log CY surfaces.</i></li>
<li>Jul. 2016, Emmy Noether Kolloquium, Johannes Gutenberg University, Mainz, Germany.<br>
<i>Symplectic cohomology and wall crossing.</i></li>
<li>Jul. 2016, Symplectic working group seminar, Cambridge University.</li>
<li>Sep. 2017, Symplectic and Poisson Geometry Seminar, University of Illinois at Urbana-Champaign.<br>
<i>Relative Floer theory and wall-crossing.</i></li>
<li>Sep. 2017, AMS Fall Southeastern Sectional Meeting, Special Session on Symplectic and Contact Topology and Dynamics, University of Central Florida.<br>
<i>Fukaya categories and Poisson geometry.</i></li>
<li>Oct. 2017, Back Porch Seminar, Austin, TX.<br>
<i>Relative Floer theory and wall-crossing.</i></li>
<li>Oct. 2017, Geometry Seminar, University of Texas at Austin.<br>
<i>Commutativity and noncommutativity in Floer theory.</i></li>
<li>Oct. 2017, Algebraic Geometry Seminar, University of Chicago.<br>
<i>2D topological field theories from algebraic and symplectic geometry (expository talk).</i></li>
<li>Nov. 2017, Algebraic Geometry Seminar, University of Chicago.<br>
<i>Symplectic geometry and theta functions.</i></li>
<li>Dec. 2017, Workshop on Categorification, Representation Theory, and Symplectic Geometry, Hausdorff Research Institute for Mathematics, Bonn.<br>
<i>Poisson geometry and monoidal Fukaya categories.</i></li>
<li>Feb. 2018, Symplectic and Poisson Geometry Seminar, University of Illinois at Urbana-Champaign.<br>
<i>Symplectic groupoids and monoidal Fukaya categories.</i></li>
<li>Apr. 2018, Introduction to Graduate Mathematics Seminar, University of Illinois at Urbana-Champaign.<br>
<i>Symplectic geometry and categorification.</i></li>
<li>Jun. 2018, Focus Program on Poisson Geometry and Physics, The Fields Institute.<br>
<i>Structures in the Floer theory of symplectic Lie groupoids.</i> (Mini-course, approximately 6 hours)</li>
<li>Jul. 2018, A Symplectic Cut, a joint seminar of King&rsquo;s College London and University College London.<br>
<i>Symplectic groupoids and monoidal Fukaya categories.</i></li>
<li>Oct. 2018, IAS/PU Symplectic Geometry and Dynamics Seminar, Institute for Advanced Study, Princeton, NJ.<br>
<i>Structures in the Floer theory of symplectic Lie groupoids.</i></li>
<li>Oct. 2018, Geometry and Physics Seminar, Northwestern University.<br>
<i>Wall-crossing formulas for Lagrangian mutations.</i> Pre-talk: <i>Monotone Lagrangians and disk counting.</i></li>
<li>Oct. 2018, Conference on Wall-crossing formula, open Gromov-Witten invariants and related areas, Institute for Basic Science/Center for Geometry and Physics, Pohang University of Science and Technology, Pohang, Korea.<br>
<i>Wall-crossing formulas for Lagrangian mutations.</i></li>
<li>Feb. 2019, Mathematics Inspired by String Theory (MIST) 2019 Workshop II, Chinese University of Hong Kong.<br>
<i>Structures in the Floer theory of symplectic Lie groupoids.</i></li>
<li>Mar. 2019, Mathematics Colloquium, Indiana University.<br>
<i>Lagrangian submanifolds and disk counting.</i></li>
<li>Mar. 2019, Number Theory and Algebraic Geometry Seminar, Boston College.<br>
<i>Lagrangian submanifolds, disk counting, and wall-crossing.</i></li>
<li>Apr. 2019, Symplectic Representation Theory, CIRM Luminy, France.<br>
<i>On monoidal structures on Fukaya categories.</i></li>
<li>Apr. 2019, Symplectic Geometry, Gauge Theory, and Categorification Seminar, Columbia University.<br>
<i>On monoidal structures on Fukaya categories.</i></li>
<li>Aug. 2019, International Conference on Symplectic Topology, IMPA, Rio de Janeiro, Brazil.<br>
<i>On the Floer-theoretic nature of canonical bases.</i></li>
<li>Dec. 2019, Hodge Institute, University of Edinburgh, Scotland.<br>
<i>Moduli spaces of Lagrangians in symplectic topology and mirror symmetry.</i></li>
<li>Jan. 2020, International Workshop on Symplectic Geometry, Sun Yat-sen University, Guangzhou, China.<br>
<i>Moduli spaces of Lagrangians in symplectic topology and mirror symmetry.</i> (Three-hour lecture series)</li>
<li>Oct. 2020, Winter School &ldquo;Connections between representation theory and geometry,&rdquo; Hausdorff Research Institute for Mathematics.<br>
<i>Introduction to Fukaya Categories.</i> (Three-hour minicourse)</li>
<li>Jun. 2021, Seminario de Geometría y Física Matemática, Universidad Católica del Norte (Chile) and Universidade de São Paulo (Brazil).<br>
<i>Structures in the Floer theory of Symplectic Groupoids.</i></li>
<li>Jun. 2021, Braids, mutations and twists in algebra and geometry, Uppsala University.<br>
<i>Moduli spaces of objects and wall-crossing for disk potentials.</i></li>
<li>Jun. 2021, Guest lecturer in a reading course on Fukaya categories, University of Vienna.<br>
<i>Examples of Fukaya categories and mirror symmetry.</i> (Three hours)</li>
<li>Nov. 2021, Geometry and Physics Seminar, Northwestern University.<br>
<i>Gluing Fukaya categories of surfaces and singularity categories.</i></li>
<li>Mar. 2022, Western Hemisphere Virtual Symplectic Seminar.<br>
<i>Categories obtained from pants decompositions.</i></li>
<li>Apr. 2022, Virtual Joint Mathematics Meetings, AMS Special Session on Quantum Categorical Structures in Mirror Symmetry.<br>
<i>Fukaya categories and pants decompositions of surfaces.</i></li>
<li>Nov. 2022, Workshop on matrix factorizations and related topics, University of Notre Dame.<br>
<i>Singular support of coherent sheaves and mirror symmetry.</i></li>
<li>Apr. 2023, AMS Spring Central Sectional Meeting, Special Session on Quantitative Aspects of Symplectic Topology, University of Cincinnati.<br>
<i>Mirrors of normal crossings surfaces at infinity.</i></li>
<li>Nov. 2023, Seminar on 3D Mirror Symmetry and Elliptic Cohomology, SISSA.<br>
<i>Higher Fukaya Categories and 3D HMS.</i></li>
</ol>
</div>
</section>
