cv.org
* Teaching and Mentoring
** Ph.D. students (all at UIUC)
   - Jesse Huang, "Toric mirror symmetry and GIT windows," Ph.D. 2021. Subsequent position: PIMS Postdoc at the University of Alberta.
   - Omar Musleh, "A-infinity algebras on directed graphs," Ph.D. 2025. Subsequent position: Assistant Professor at the Jordan University of Science and Technology (JUST).
   - Jie Yeo. (started Fall 2022)

** UIUC
   (*TRE* = List of teachers ranked as excellent by their students.)
   - Spring 2025: Algebraic Topology I (Math 525)
   - Spring 2025: Introduction to Abstract Algebra (Math 417)
   - Fall 2024: Fundamental Mathematics (Math 347, merit section)
   - Spring 2024: Differentiable Manifolds II (Math 519)^{*TRE*}
   - Spring 2024: Fundamental Mathematics (Math 347)
   - Fall 2023: Introduction to Abstract Algebra (MATH 417)
   - Fall 2022: Differentiable Manifolds I (MATH 518)
   - Fall 2022: Fukaya categories of surfaces (MATH 595)
   - Fall 2021: Introduction to Abstract Algebra (MATH 417, 2 sections)^{*TRE*}
   - Spring 2021: Introduction to Abstract Algebra (MATH 417, 2 sections)
   - Spring 2020: Vector and Tensor Analysis (MATH 481)^{*TRE*}
   - Fall 2019: Introduction to Abstract Algebra (MATH 417)^{*TRE*}
   - Fall 2019: Riemann Surfaces and Algebraic Curves (MATH 510)^{*TRE*}
   - Spring 2019: Illinois Geometry Lab Project, Homological Algebra of Quiver Representations (5 undergraduate researchers).
   - Fall 2018: Illinois Geometry Lab Project, Geometric Group Actions on Categories (5 undergraduate researchers).
   - Fall 2018: Calculus III (MATH 241, 2 sections)
   - Spring 2018: Homological Mirror Symmetry (graduate topic course, MATH 595)^{*TRE*}
   - Spring 2018: Introduction to Abstract Algebra (MATH 417)^{*TRE*}
   - Fall 2017: General Topology (MATH 535)^{*TRE*}
   - Fall 2016: Calculus III (MATH 241, 2 sections)
   - Spring 2016: Riemann Surfaces and Algebraic Curves (MATH 510)
   - Spring 2016: Introduction to Differential Equations (MATH 285)
   - Spring 2015: Differentiable Manifolds II (MATH 519)
   - Fall 2014: Introduction to Differential Equations (MATH 285, 2 sections)

** SISSA
   - Spring 2022: Topics in Homological Mirror Symmetry (20 hours)
   
** UT Austin
   - Spring 2014: Lagrangian Floer Homology (graduate topic course, M 392C)
   - Fall 2013: Differential and Integral Calculus (\sim120 students, M 408C)
   - Spring 2013: Multivariable Calculus (\sim120 students, M 408M)
   - Fall 2012: Advanced Calculus for Applications I (Differential equations and Fourier series, \sim120 students, M 427K)
   - Spring 2012: Probability I (M 362K)
   - Fall 2011: Sequences, Series, and Multivariable Calculus (\sim120 students, M 408D)

** MIT
   - Summer 2009:  Mentor for two students in SPUR.
     - Emily Berger (MIT 2011), /Hurwitz equivalence in the dihedral group/.
     - Colin Sandon (MIT 2012), /Curves in tropical geometry/.
   - Spring 2009:  Recitation Instructor and Course Administrator for 18.02, Multivariable Calculus.
   - Fall 2008: Recitation Instructor for 18.06, Linear Algebra.
   - Summer 2008: Instructor for 18.085, Mathematical Methods for Engineers (first half).
   - Spring 2008: Assistant for 18.821, Project Laboratory in Mathematics.
   - Fall 2007: Grader for 18.100C, Analysis I with writing instruction.

** U. of Chicago
   - Summer 2019: Instructor, grades 11--12, U. of Chicago Young Scholars Program.
   - Fall 2005: Grader for Honors Calculus (Math 161), Set Theory and Metric Spaces (Math 261).
   - Summer 2005: Lead Counselor, grades 11--12, U. of Chicago Young Scholars Program.
   - Winter--Spring 2005: Junior Tutor in Mathematics for Introductory Calculus (Math 152, 153).
   - Summer 2003, 2004: Counselor, U. of Chicago Young Scholars Program.

* Service activities
** External
   - External referee for the Ph.D. thesis of Hayato Morimura, SISSA (September 8, 2023), and Soham Chanda, Rutgers University (March 5, 2024).

** UIUC
   - Undergraduate Affairs Committee (2024--2026, Chair).
   - Teaching mentor for junior faculty (2024--).
   - P&T subcommittee (Fall 2024).
   - MDAB: faculty liaison for Student Success subcommittee (2024--).
   - Capricious Grading Committee (2023--2024).
   - Climate, Equity, and Inclusivity committee (Fall 2022).
   - Teaching Awards committee (2022--2023).
   - Organizer of Symplectic and Poisson Geometry Seminar (Fall 2016, AY 2018--19, AY 2019--20).
   - Preliminary examination committees for Daan Michiels (March 5,
     2015), Melinda Lanius (May 4, 2015), Sungwoo Nam (April 10,
     2019), Nachiketa Adhikari (August 13, 2020), Shuyu Xiao (November
     10, 2021), Sambit Senapati (December 9, 2021), Nicole Yamzon
     (January 26, 2023; committee chair), Ciaran O'Neill (March 11,
     2023), Jonghyeon Ahn (November 28, 2023; committee chair), Zijing
     Ye (January 15, 2024), Nikolay Sheshko (May 2, 2024), Omar Musleh
     (May 8, 2024), Ruoxi Li (October 11, 2024), Aerim Si (August 20, 2025).
   - Final examination committees for Daan Michiels (March 27, 2018),
     Joel Villatoro (April 26, 2018), Matej Penciak (June 17, 2019;
     committee chair), Jesse Huang (May 5, 2021), Yuxuan Zhang (May
     27, 2022), Sungwoo Nam (June 2, 2023), Shuyu Xiao (April 3, 2024), Omar Musleh (April 10, 2025), Ciaran O'Neill (November 6, 2025).
   - Reviewer for the Campus Research Board.
   - Mathematics Department Executive Committee (2020--2021). /This elected committee is responsible for all budgetary decisions, faculty hiring, and the yearly faculty evaluation for raises./
   - Graduate affairs committee (2019--2020).
   - Capricious grading committee (2019--2020).
   - Altgeld/Illini renovation committee (2019--2021).
   - Undergraduate affairs committee (2015--2019).
   - Picnic committee (2014, 2018, 2021).

** IAS
   - Co-organizer, with Paul Seidel, of the "Workshop on Homological Mirror Symmetry: Emerging Developments and Applications," March 13--17, 2017, Institute for Advanced Study, Princeton, NJ. This was the spring workshop for the special year on homological mirror symmetry at IAS.
   - Organized a reading group on higher genus Gromov-Witten theory at IAS in the Spring 2017 semester.

** UT Austin 
  - Co-organizer of the "Graduate Geometry and Topology Current Literature Seminar."

