cv.html

<section id="outline-container-orgd675529" class="outline-2">
<h2 id="orgd675529">Teaching and Mentoring</h2>
<div class="outline-text-2" id="text-orgd675529">
</div>
<div id="outline-container-org8144646" class="outline-3">
<h3 id="org8144646">Ph.D. students</h3>
<div class="outline-text-3" id="text-org8144646">
<ul class="org-ul">
<li>Jesse Huang (UIUC, Ph.D. 2021. Subsequent position: PIMS Postdoc at the University of Alberta)</li>
<li>Jie Yeo (UIUC, started Fall 2022).</li>
<li>Omar Musleh (UIUC, started Fall 2022).</li>
</ul>
</div>
</div>

<div id="outline-container-org5037554" class="outline-3">
<h3 id="org5037554">UIUC</h3>
<div class="outline-text-3" id="text-org5037554">
<p>
(<b>TRE</b> = List of teachers ranked as excellent by their students.)
</p>
<ul class="org-ul">
<li>Spring 2024: Differentiable Manifolds II (Math 519)<sup><b>TRE</b></sup></li>
<li>Spring 2024: Fundamental Mathematics (Math 347)</li>
<li>Fall 2023: Introduction to Abstract Algebra (MATH 417)</li>
<li>Fall 2022: Differentiable Manifolds I (MATH 518)</li>
<li>Fall 2022: Fukaya categories of surfaces (MATH 595)</li>
<li>Fall 2021: Introduction to Abstract Algebra (MATH 417, 2 sections)<sup><b>TRE</b></sup></li>
<li>Spring 2021: Introduction to Abstract Algebra (MATH 417, 2 sections)</li>
<li>Spring 2020: Vector and Tensor Analysis (MATH 481)<sup><b>TRE</b></sup></li>
<li>Fall 2019: Introduction to Abstract Algebra (MATH 417)<sup><b>TRE</b></sup></li>
<li>Fall 2019: Riemann Surfaces and Algebraic Curves (MATH 510)<sup><b>TRE</b></sup></li>
<li>Spring 2019: Illinois Geometry Lab Project, Homological Algebra of Quiver Representations (5 undergraduate researchers).</li>
<li>Fall 2018: Illinois Geometry Lab Project, Geometric Group Actions on Categories (5 undergraduate researchers).</li>
<li>Fall 2018: Calculus III (MATH 241, 2 sections)</li>
<li>Spring 2018: Homological Mirror Symmetry (graduate topic course, MATH 595)<sup><b>TRE</b></sup></li>
<li>Spring 2018: Introduction to Abstract Algebra (MATH 417)<sup><b>TRE</b></sup></li>
<li>Fall 2017: General Topology (MATH 535)<sup><b>TRE</b></sup></li>
<li>Fall 2016: Calculus III (MATH 241, 2 sections)</li>
<li>Spring 2016: Riemann Surfaces and Algebraic Curves (MATH 510)</li>
<li>Spring 2016: Introduction to Differential Equations (MATH 285)</li>
<li>Spring 2015: Differentiable Manifolds II (MATH 519)</li>
<li>Fall 2014: Introduction to Differential Equations (MATH 285, 2 sections)</li>
</ul>
</div>
</div>

<div id="outline-container-org1f2f6e8" class="outline-3">
<h3 id="org1f2f6e8">SISSA</h3>
<div class="outline-text-3" id="text-org1f2f6e8">
<ul class="org-ul">
<li>Spring 2022: Topics in Homological Mirror Symmetry (20 hours)</li>
</ul>
</div>
</div>

<div id="outline-container-org4835b08" class="outline-3">
<h3 id="org4835b08">UT Austin</h3>
<div class="outline-text-3" id="text-org4835b08">
<ul class="org-ul">
<li>Spring 2014: Lagrangian Floer Homology (graduate topic course, M 392C)</li>
<li>Fall 2013: Differential and Integral Calculus (&sim;120 students, M 408C)</li>
<li>Spring 2013: Multivariable Calculus (&sim;120 students, M 408M)</li>
<li>Fall 2012: Advanced Calculus for Applications I (Differential equations and Fourier series, &sim;120 students, M 427K)</li>
<li>Spring 2012: Probability I (M 362K)</li>
<li>Fall 2011: Sequences, Series, and Multivariable Calculus (&sim;120 students, M 408D)</li>
</ul>
</div>
</div>

<div id="outline-container-org054dc64" class="outline-3">
<h3 id="org054dc64">MIT</h3>
<div class="outline-text-3" id="text-org054dc64">
<ul class="org-ul">
<li>Summer 2009:  Mentor for two students in SPUR.
<ul class="org-ul">
<li>Emily Berger (MIT 2011), <i>Hurwitz equivalence in the dihedral group</i>.</li>
<li>Colin Sandon (MIT 2012), <i>Curves in tropical geometry</i>.</li>
</ul></li>
<li>Spring 2009:  Recitation Instructor and Course Administrator for 18.02, Multivariable Calculus.</li>
<li>Fall 2008: Recitation Instructor for 18.06, Linear Algebra.</li>
<li>Summer 2008: Instructor for 18.085, Mathematical Methods for Engineers (first half).</li>
<li>Spring 2008: Assistant for 18.821, Project Laboratory in Mathematics.</li>
<li>Fall 2007: Grader for 18.100C, Analysis I with writing instruction.</li>
</ul>
</div>
</div>

<div id="outline-container-org5094a11" class="outline-3">
<h3 id="org5094a11">U. of Chicago</h3>
<div class="outline-text-3" id="text-org5094a11">
<ul class="org-ul">
<li>Summer 2019: Instructor, grades 11&#x2013;12, U. of Chicago Young Scholars Program.</li>
<li>Fall 2005: Grader for Honors Calculus (Math 161), Set Theory and Metric Spaces (Math 261).</li>
<li>Summer 2005: Lead Counselor, grades 11&#x2013;12, U. of Chicago Young Scholars Program.</li>
<li>Winter&#x2013;Spring 2005: Junior Tutor in Mathematics for Introductory Calculus (Math 152, 153).</li>
<li>Summer 2003, 2004: Counselor, U. of Chicago Young Scholars Program.</li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org6757359" class="outline-2">
<h2 id="org6757359">Service activities</h2>
<div class="outline-text-2" id="text-org6757359">
</div>
<div id="outline-container-org9e7b6e3" class="outline-3">
<h3 id="org9e7b6e3">External</h3>
<div class="outline-text-3" id="text-org9e7b6e3">
<ul class="org-ul">
<li>External referee for the Ph.D. thesis of Hayato Morimura, SISSA (September 8, 2023), and Soham Chanda, Rutgers University (March 5, 2024).</li>
</ul>
</div>
</div>

<div id="outline-container-orga41302a" class="outline-3">
<h3 id="orga41302a">UIUC</h3>
<div class="outline-text-3" id="text-orga41302a">
<ul class="org-ul">
<li>Undergraduate Affairs Committee (2024&#x2013;2026, Chair).</li>
<li>Teaching mentor for junior faculty (2024&#x2013;).</li>
<li>P&amp;T subcommittee (Fall 2024).</li>
<li>MDAB: faculty liaison for Student Success subcommittee (2024&#x2013;).</li>
<li>Capricious Grading Committee (2023&#x2013;2024).</li>
<li>Climate, Equity, and Inclusivity committee (Fall 2022).</li>
<li>Teaching Awards committee (2022&#x2013;2023).</li>
<li>Organizer of Symplectic and Poisson Geometry Seminar (Fall 2016, AY 2018&#x2013;19, AY 2019&#x2013;20).</li>
<li>Preliminary examination committees for Daan Michiels (March 5,
2015), Melinda Lanius (May 4, 2015), Sungwoo Nam (April 10,
2019), Nachiketa Adhikari (August 13, 2020), Shuyu Xiao (November
10, 2021), Sambit Senapati (December 9, 2021), Nicole Yamzon
(January 26, 2023; committee chair), Ciaran O&rsquo;Neill (March 11,
2023), Jonghyeon Ahn (November 28, 2023; committee chair), Zijing
Ye (January 15, 2024), Nikolay Sheshko (May 2, 2024), Omar Musleh
(May 8, 2024), Ruoxi Li (October 11, 2024).</li>
<li>Final examination committees for Daan Michiels (March 27, 2018),
Joel Villatoro (April 26, 2018), Matej Penciak (June 17, 2019;
committee chair), Jesse Huang (May 5, 2021), Yuxuan Zhang (May
27, 2022), Sungwoo Nam (June 2, 2023), Shuyu Xiao (April 3, 2024).</li>
<li>Reviewer for the Campus Research Board.</li>
<li>Mathematics Department Executive Committee (2020&#x2013;2021). <i>This elected committee is responsible for all budgetary decisions, faculty hiring, and the yearly faculty evaluation for raises.</i></li>
<li>Graduate affairs committee (2019&#x2013;2020).</li>
<li>Capricious grading committee (2019&#x2013;2020).</li>
<li>Altgeld/Illini renovation committee (2019&#x2013;2021).</li>
<li>Undergraduate affairs committee (2015&#x2013;2019).</li>
<li>Picnic committee (2014, 2018, 2021).</li>
</ul>
</div>
</div>

<div id="outline-container-org5479d40" class="outline-3">
<h3 id="org5479d40">IAS</h3>
<div class="outline-text-3" id="text-org5479d40">
<ul class="org-ul">
<li>Co-organizer, with Paul Seidel, of the &ldquo;Workshop on Homological Mirror Symmetry: Emerging Developments and Applications,&rdquo; March 13&#x2013;17, 2017, Institute for Advanced Study, Princeton, NJ. This was the spring workshop for the special year on homological mirror symmetry at IAS.</li>
<li>Organized a reading group on higher genus Gromov-Witten theory at IAS in the Spring 2017 semester.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcffbe54" class="outline-3">
<h3 id="orgcffbe54">UT Austin</h3>
<div class="outline-text-3" id="text-orgcffbe54">
<ul class="org-ul">
<li>Co-organizer of the &ldquo;Graduate Geometry and Topology Current Literature Seminar.&rdquo;</li>
</ul>
</div>
</div>
